app/controllers/issues_controller.rb

INSERT INTO "issues" ("assigned_to_id", "created_at", "description", "estimate", "issue_priority_id", "issue_type_id", "number", "position", "project_id", "reported_by_id", "sprint_id", "sprint_position", "state", "summary", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    add_breadcrumb :new

    create_another = !!params[:issue].delete(:create_another)

    @issue = @project.backlog_items.build(params[:issue])
    @issue.reported_by = current_user

    if @issue.save

UPDATE "issues" SET "estimate" = 2.0, "updated_at" = '2013-12-10 05:42:34.578080' WHERE "issues"."id" = 5
---
  def update
    @issue.update_attributes(params[:issue])

UPDATE "issues" SET "assigned_to_id" = 1, "updated_at" = '2013-12-10 05:43:53.271507' WHERE "issues"."id" = 5
---
  def assign_to_me
    @issue.assigned_to = current_user
    @issue.save

UPDATE "issues" SET "position" = NULL, "updated_at" = '2013-12-10 05:42:11.159513' WHERE "issues"."id" = 2
UPDATE "projects" SET "updated_at" = '2013-12-10 05:42:11.162449' WHERE "projects"."id" = 1
---
  def reorder
    @issue = @project.backlog_items.find(params[:issue_id])
    @issue.becomes(SprintItem).remove_from_list if @issue.sprint

    @issue.remove_from_list

    @issue.sprint_id = nil
    @issue.save