app/controllers/sprints_controller.rb

  def create
    @sprint = @project.sprints.create(:name => "Unnamed sprint")
---
INSERT INTO "sprints" ("active", "created_at", "end_date", "finished", "name", "project_id", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def reorder
    @issue = @project.sprint_items.find(params[:issue_id])
    @issue.becomes(BacklogItem).remove_from_list

    @issue.remove_from_list

    @issue.sprint_id = @project.sprints.find(params[:id]).id
    @issue.save
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1 AND "sprints"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "issues" SET "issue_type_id" = 3, "issue_priority_id" = 3, "position" = NULL, "updated_at" = '2013-12-10 05:39:28.311778' WHERE "issues"."id" = 1
UPDATE "projects" SET "updated_at" = '2013-12-10 05:39:28.315762' WHERE "projects"."id" = 1

  def start
    @sprint = @project.sprints.find(params[:id])
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1 AND "sprints"."id" = $1 LIMIT 1  [["id", "1"]]

  def current
    add_breadcrumb :current
    @sprint = @project.sprints.find_by_active(true)
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1 AND "sprints"."active" = 't' LIMIT 1